; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-3)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	)
(:init
	(at plane1 city5)
	(= (capacity plane1) 2433)
	(= (fuel plane1) 695)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 2)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 2)
	(at plane2 city4)
	(= (capacity plane2) 2144)
	(= (fuel plane2) 151)
	(= (slow-burn plane2) 1)
	(= (fast-burn plane2) 3)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 3)
	(at plane3 city0)
	(= (capacity plane3) 10579)
	(= (fuel plane3) 3395)
	(= (slow-burn plane3) 5)
	(= (fast-burn plane3) 11)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 7)
	(at plane4 city0)
	(= (capacity plane4) 2495)
	(= (fuel plane4) 165)
	(= (slow-burn plane4) 1)
	(= (fast-burn plane4) 2)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 4)
	(at plane5 city1)
	(= (capacity plane5) 3035)
	(= (fuel plane5) 950)
	(= (slow-burn plane5) 1)
	(= (fast-burn plane5) 2)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 9)
	(at person1 city0)
	(at person2 city0)
	(at person3 city7)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 804)
	(= (distance city0 city2) 675)
	(= (distance city0 city3) 626)
	(= (distance city0 city4) 543)
	(= (distance city0 city5) 773)
	(= (distance city0 city6) 578)
	(= (distance city0 city7) 938)
	(= (distance city1 city0) 804)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 723)
	(= (distance city1 city3) 521)
	(= (distance city1 city4) 677)
	(= (distance city1 city5) 729)
	(= (distance city1 city6) 979)
	(= (distance city1 city7) 797)
	(= (distance city2 city0) 675)
	(= (distance city2 city1) 723)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 947)
	(= (distance city2 city4) 785)
	(= (distance city2 city5) 856)
	(= (distance city2 city6) 760)
	(= (distance city2 city7) 596)
	(= (distance city3 city0) 626)
	(= (distance city3 city1) 521)
	(= (distance city3 city2) 947)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 616)
	(= (distance city3 city5) 718)
	(= (distance city3 city6) 766)
	(= (distance city3 city7) 941)
	(= (distance city4 city0) 543)
	(= (distance city4 city1) 677)
	(= (distance city4 city2) 785)
	(= (distance city4 city3) 616)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 865)
	(= (distance city4 city6) 945)
	(= (distance city4 city7) 518)
	(= (distance city5 city0) 773)
	(= (distance city5 city1) 729)
	(= (distance city5 city2) 856)
	(= (distance city5 city3) 718)
	(= (distance city5 city4) 865)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 625)
	(= (distance city5 city7) 716)
	(= (distance city6 city0) 578)
	(= (distance city6 city1) 979)
	(= (distance city6 city2) 760)
	(= (distance city6 city3) 766)
	(= (distance city6 city4) 945)
	(= (distance city6 city5) 625)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 971)
	(= (distance city7 city0) 938)
	(= (distance city7 city1) 797)
	(= (distance city7 city2) 596)
	(= (distance city7 city3) 941)
	(= (distance city7 city4) 518)
	(= (distance city7 city5) 716)
	(= (distance city7 city6) 971)
	(= (distance city7 city7) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane4 city6)
	(at plane5 city7)
	(at person1 city4)
	(at person2 city4)
	(at person3 city1)
	))

(:metric minimize (+ (* 1 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (refuel plane4 city0)
   changed: (fuel plane4) from 165 to 2495
   goals met: 0 of 5
2. (fly plane4 city0 city6)
   deleted: (at plane4 city0)
   added: (at plane4 city6)
   changed: (total-fuel-used) from 0 to 578, (fuel plane4) from 2495 to 1917
   goals met: 1 of 5
3. (board person1 plane3 city0)
   deleted: (at person1 city0)
   added: (in person1 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 1 of 5
4. (board person2 plane3 city0)
   deleted: (at person2 city0)
   added: (in person2 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 1 of 5
5. (fly plane3 city0 city4)
   deleted: (at plane3 city0)
   added: (at plane3 city4)
   changed: (total-fuel-used) from 578 to 3293, (fuel plane3) from 3395 to 680
   goals met: 1 of 5
6. (fly plane5 city1 city7)
   deleted: (at plane5 city1)
   added: (at plane5 city7)
   changed: (total-fuel-used) from 3293 to 4090, (fuel plane5) from 950 to 153
   goals met: 2 of 5
7. (debark person1 plane3 city4)
   deleted: (in person1 plane3)
   added: (at person1 city4)
   changed: (onboard plane3) from 2 to 1
   goals met: 3 of 5
8. (debark person2 plane3 city4)
   deleted: (in person2 plane3)
   added: (at person2 city4)
   changed: (onboard plane3) from 1 to 0
   goals met: 4 of 5
9. (board person3 plane5 city7)
   deleted: (at person3 city7)
   added: (in person3 plane5)
   changed: (onboard plane5) from 0 to 1
   goals met: 4 of 5
10. (refuel plane5 city7)
   changed: (fuel plane5) from 153 to 3035
   goals met: 4 of 5
11. (fly plane5 city7 city1)
   deleted: (at plane5 city7)
   added: (at plane5 city1)
   changed: (total-fuel-used) from 4090 to 4887, (fuel plane5) from 3035 to 2238
   goals met: 3 of 5
12. (debark person3 plane5 city1)
   deleted: (in person3 plane5)
   added: (at person3 city1)
   changed: (onboard plane5) from 1 to 0
   goals met: 4 of 5
13. (fly plane5 city1 city7)
   deleted: (at plane5 city1)
   added: (at plane5 city7)
   changed: (total-fuel-used) from 4887 to 5684, (fuel plane5) from 2238 to 1441
   goals met: 5 of 5
